lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE81.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >
  <vendor>Milandr</vendor>                                       <!-- device vendor name -->
  <vendorID>Milandr</vendorID>                                    <!-- device vendor short name -->
  <name>MDR1986VE81</name>
  <series>ARMCM4</series>
  <version>2.0</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>ARM 32-bit Cortex-M4 Microcontroller based device, CPU clock up to 60MHz, etc. </description>

  <cpu>                      
    <name>CM4</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->

  <!-- Peripherals -->
  <peripherals>
    <!-- #RST -->
    <!-- RST_CLOCK -->
    <peripheral>
      <name>MDR_RST_CLOCK</name>
      <version>1.0</version>
      <description>CLock Control</description>
      <groupName>RST_CLK</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!-- #RST_SIZE -->
        <size>0x1D0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- KEY -->
        <register>
          <name>KEY</name>
          <description>Clock Unlock Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>      
            <field>
              <name>Value</name>
              <description>Reg value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!-- MAX_CLK -->
        <register>
          <name>MAX_CLK</name>
          <description>MAX_CLK Select Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>      
            <field>
              <name>Select</name>
              <description>Select MAX_CLOCK source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>HSI</name>      <description>MAX_CLOCK is HSI</description>   <value>0</value></enumeratedValue>
                <enumeratedValue><name>HSI_div2</name> <description>MAX_CLOCK is HSI/2</description> <value>1</value></enumeratedValue>
                <enumeratedValue><name>HSE0</name>     <description>MAX_CLOCK is HSE0</description>  <value>2</value></enumeratedValue>
                <enumeratedValue><name>HSE0_div2</name><description>MAX_CLOCK is HSE0/2</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>HSE1</name>     <description>MAX_CLOCK is HSE1</description>  <value>4</value></enumeratedValue>
                <enumeratedValue><name>HSE1_div2</name><description>MAX_CLOCK is HSE1/2</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>LSI</name> <description>MAX_CLOCK is LSI</description> <value>6</value></enumeratedValue>
                <enumeratedValue><name>LSE</name> <description>MAX_CLOCK is LSE</description> <value>7</value></enumeratedValue>
                <enumeratedValue><name>PLL0</name><description>MAX_CLOCK is PLL0</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>PLL1</name><description>MAX_CLOCK is PLL1</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>PLL2</name><description>MAX_CLOCK is PLL2</description><value>10</value></enumeratedValue>
                <!-- #SEL_PLL -->
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- CPU_CLK -->
        <register>
          <name>CPU_CLK</name>
          <description>CPU_CLK Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>      
            <field>
              <name>DIV</name>
              <description>CPU_CLock div from MAX_CLOCK</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <!-- #CLK_CTRL_EVENTS -->
            <field>
              <name>EN_CHK_EVENT0</name>
              <description>Go to HSI on lose active clock</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT1</name>
              <description>Go to HSI if active clock is low</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT2</name>
              <description>Go to HSI if active clock is High</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT3</name>
              <description>Go to HSI if active clock is Highest</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK</name>
              <description>Clock Checker enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CLR_CHK_SHIFT_REG0</name>
              <description>Clear Min Freq level</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Clear level</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_SHIFT_REG1</name>
              <description>Clear Max Freq level</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT0</name>
              <description>Clear no freq event</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT1</name>
              <description>Clear low freq event</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT2</name>
              <description>Clear high freq event</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT3</name>
              <description>Clear highest freq event</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <!-- PER0_CLK -->
        <register>
          <name>PER0_CLK</name>
          <description>Periph0 Clock Enable Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #PER0_MASK -->
          <resetMask>0x27C3E000</resetMask>
          <fields> 
            <!-- #PER0_VK14_B -->
            <field>
              <name>PortA_CLK_EN</name>
              <description>GPIO Port Clock Enable</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>PortB_CLK_EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>PortC_CLK_EN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>PortD_CLK_EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <!-- #PER0_ESila -->
            <!-- #PER0_VE8 -->
            <field derivedFrom="PortA_CLK_EN">
              <name>PortE_CLK_EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>SPW1_CLK_EN</name>
              <description>SPW1 Clock Enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>TIM1_CLK_EN</name>
              <description>TIM1 Clock Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>TIM2_CLK_EN</name>
              <description>TIM2 Clock Enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>TIM3_CLK_EN</name>
              <description>TIM3 Clock Enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>TIM4_CLK_EN</name>
              <description>TIM4 Clock Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field derivedFrom="PortA_CLK_EN">
              <name>CAN1_CLK_EN</name>
              <description>CAN1 Clock Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <!-- #PER0_VK14_E -->
          </fields>
        </register>
        <!-- PER1_CLK -->
        <register>
          <name>PER1_CLK</name>
          <description>Periph1 Clock Enable Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #PER1_MASK -->
          <resetMask>0x07A828C4</resetMask>
          <fields> 
            <!-- #PER1_ESila -->
            <!-- #PER1_VE8 -->
            <field>
              <name>SSP1_CLK_EN</name>
              <description>SSP1 Clock Enable</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>UART1_CLK_EN</name>
              <description>UART1 Clock Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>UART2_CLK_EN</name>
              <description>UART2 Clock Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>ARINK_RX_CLK_EN</name>
              <description>ARINK_RX Clock Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>ARINK_TX_CLK_EN</name>
              <description>ARINK_TX Clock Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>MIL1_CLK_EN</name>
              <description>MIL1 Clock Enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>MIL2_CLK_EN</name>
              <description>MIL2 Clock Enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>ADC1_CLK_EN</name>
              <description>ADC1 Clock Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>ADC2_CLK_EN</name>
              <description>ADC2 Clock Enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>DAC1_CLK_EN</name>
              <description>DAC1 Clock Enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="SSP1_CLK_EN">
              <name>DAC2_CLK_EN</name>
              <description>DAC2 Clock Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <!-- #PER1_VK14 -->
          </fields>
        </register>
