lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE81.svd
        <!-- HSE0_CHK0 -->
        <register derivedFrom="CPU_CHK0">
          <name>HSE0_CHK0</name>
          <addressOffset>0x00000054</addressOffset>
        </register>    
        <!-- HSE0_CHK1 -->
        <register derivedFrom="CPU_CHK1">
          <name>HSE0_CHK1</name>
          <addressOffset>0x00000058</addressOffset>
        </register>
        <!-- HSE0_CHK2 -->
        <register derivedFrom="CPU_CHK2">
          <name>HSE0_CHK2</name>
          <addressOffset>0x0000005C</addressOffset>
        </register>
        <!-- HSE0_STAT -->
        <register derivedFrom="LSE_STAT">
          <name>HSE0_STAT</name>
          <addressOffset>0x00000060</addressOffset>
        </register>
        <!-- HSE1_CLK -->
        <register derivedFrom="HSE0_CLK">
          <name>HSE1_CLK</name>
          <addressOffset>0x00000064</addressOffset>
        </register>    
        <!-- HSE1_CHK0 -->
        <register derivedFrom="CPU_CHK0">
          <name>HSE1_CHK0</name>
          <addressOffset>0x00000068</addressOffset>
        </register>    
        <!-- HSE1_CHK1 -->
        <register derivedFrom="CPU_CHK1">
          <name>HSE1_CHK1</name>
          <addressOffset>0x0000006C</addressOffset>
        </register>
        <!-- HSE1_CHK2 -->
        <register derivedFrom="CPU_CHK2">
          <name>HSE1_CHK2</name>
          <addressOffset>0x00000070</addressOffset>
        </register>
        <!-- HSE1_STAT -->
        <register derivedFrom="LSE_STAT">
          <name>HSE1_STAT</name>
          <addressOffset>0x00000074</addressOffset>
        </register>
        <!-- PLL0_CLK -->
        <register>
          <name>PLL0_CLK</name>
          <description>PLL0 Control</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #PLL0_CLK -->
          <resetMask>0xFFFFFF1F</resetMask>
          <fields>
            <field>
              <name>PLL_Q</name>
              <description>PLL Freq divider</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>div1</name><description>Divider</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>Divider</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div3</name><description>Divider</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>Divider</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>div5</name><description>Divider</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>div6</name><description>Divider</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>div7</name><description>Divider</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>Divider</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>div9</name><description>Divider</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>div10</name><description>Divider</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>div11</name><description>Divider</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>div12</name><description>Divider</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>div13</name><description>Divider</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>div14</name><description>Divider</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>div15</name><description>Divider</description><value>14</value></enumeratedValue>        
                <enumeratedValue><name>div16</name><description>Divider</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DV</name>
              <description>PLL Output Divider</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>div1</name><description>Divider</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>Divider</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>PLL_N</name>
              <description>PLL Freq multiplier</description>
              <bitRange>[14:8]</bitRange>    
            </field>
            <field>
              <name>EN_CHK_EVENT0</name>
              <description>Go to HSI on lose active clock</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT1</name>
              <description>Go to HSI if active clock is low</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT2</name>
              <description>Go to HSI if active clock is High</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK_EVENT3</name>
              <description>Go to HSI if active clock is Highest</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0">
              <name>EN_CHK</name>
              <description>Clock Checker enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CLR_CHK_SHIFT_REG0</name>
              <description>Clear Min Freq level</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Clear level</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_SHIFT_REG1</name>
              <description>Clear Max Freq level</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT0</name>
              <description>Clear no freq event</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT1</name>
              <description>Clear low freq event</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT2</name>
              <description>Clear high freq event</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field derivedFrom="CLR_CHK_SHIFT_REG0">
              <name>CLR_CHK_EVENT3</name>
              <description>Clear highest freq event</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field derivedFrom="EN_CHK_EVENT0"> 
              <name>PLL_ON</name>
              <description>PLL Enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PLL_RLD</name>
              <description>PLL Reload</description>
              <bitRange>[28:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Inactive state</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Reload</name><description>Reload PLL</description><value>1</value></enumeratedValue>
              </enumeratedValues>      
            </field>
            <field>
              <name>SELECT</name>
              <description>Select PLL Input</description>
              <bitRange>[31:29]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>HSI</name><description>HSI signal</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>HSI_div2</name><description>HSI/2 signal</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>HSE0</name><description>HSE0 signal</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>HSE0_div2</name><description>HSE0/2 signal</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>HSE1</name><description>HSE1 signal</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>HSE1_div2</name><description>HSE1/2 signal</description><value>5</value></enumeratedValue>
              </enumeratedValues>      
            </field>
          </fields>
        </register>
        <!-- PLL0_CHK0 -->
        <register derivedFrom="CPU_CHK0">
          <name>PLL0_CHK0</name>
          <addressOffset>0x0000007C</addressOffset>
        </register>    
        <!-- PLL0_CHK1 -->
        <register derivedFrom="CPU_CHK1">
          <name>PLL0_CHK1</name>
          <addressOffset>0x00000080</addressOffset>
        </register>
        <!-- PLL0_CHK2 -->
        <register derivedFrom="CPU_CHK2">
          <name>PLL0_CHK2</name>
          <addressOffset>0x00000084</addressOffset>
        </register>
        <!-- PLL0_STAT -->
        <register derivedFrom="LSE_STAT">
          <name>PLL0_STAT</name>
          <addressOffset>0x00000088</addressOffset>
        </register>
