lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE81.svd
        <!--SFUNC2-->
        <register derivedFrom="MDR_PORTA.FUNC2">
          <name>FUNC2_Set</name>
          <description>Set FUNC2 bits</description>
          <addressOffset>0x00000020</addressOffset>
          <access>write-only</access>
        </register>
        <!--SFUNC3-->
        <register derivedFrom="MDR_PORTA.FUNC3">
          <name>FUNC3_Set</name>
          <description>Set FUNC3 bits</description>
          <addressOffset>0x00000024</addressOffset>
          <access>write-only</access>
        </register>
        <!--CFUNC0-->
        <register>
          <name>FUNC0_Clear</name>
          <description>Clear FUNC0 bits</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>0-7</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Clear FUNC0 bits</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No Action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>ClearToPort</name><description>Set Pin to Port function</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--CFUNC1-->
        <register>
          <name>FUNC1_Clear</name>
          <description>Clear FUNC1 bits</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>8-15</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Clear FUNC1 bits</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No Action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>ClearToPort</name><description>Set Pin to Port function</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--CFUNC2-->
        <register>
          <name>FUNC2_Clear</name>
          <description>Clear FUNC2 bits</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>16-23</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Clear FUNC2 bits</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No Action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>ClearToPort</name><description>Set Pin to Port function</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
