lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE81.svd
        <!--CFUNC3-->
        <register>
          <name>FUNC3_Clear</name>
          <description>Clear FUNC3 bits</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>8</dim>
              <dimIncrement>4</dimIncrement>
              <dimIndex>24-31</dimIndex>
              <name>Func_Pin_%s</name>
              <description>Clear FUNC3 bits</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No Action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_1</name><description>Function periph pin control</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_2</name><description>Function periph pin control</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_3</name><description>Function periph pin control</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_4</name><description>Function periph pin control</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_5</name><description>Function periph pin control</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_6</name><description>Function periph pin control</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_7</name><description>Function periph pin control</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_8</name><description>Function periph pin control</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_9</name><description>Function periph pin control</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_10</name><description>Function periph pin control</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_11</name><description>Function periph pin control</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_12</name><description>Function periph pin control</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_13</name><description>Function periph pin control</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>ClrFunc_14</name><description>Function periph pin control</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>ClearToPort</name><description>Set Pin to Port function</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--ANALOG-->
        <register>
          <name>ANALOG</name>
          <description>Pins Digital Mode</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Pins Digital Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Analog</name><description>Pin Analog signal</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Digital</name><description>Pin Digital signal</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SANALOG-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>ANALOG_Set</name>
          <description>Set ANALOG bits</description>
          <addressOffset>0x00000038</addressOffset>
        </register>
        <!--CANALOG-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>ANALOG_Clear</name>
          <description>Clear ANALOG bits</description>
          <addressOffset>0x0000003C</addressOffset>
        </register>
        <!--PULLUP-->
        <register>
          <name>PULLUP</name>
          <description>Pins PullUP State</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Pins PullUp State</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>No pull selected</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>UP</name><description>Pin pulled up to VDD</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SPULLUP-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>PULLUP_Set</name>
          <description>Set PULLUP bits</description>
          <addressOffset>0x00000040</addressOffset>
        </register>
        <!--CPULLUP-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>PULLUP_Clear</name>
          <description>Clear PULLUP bits</description>
          <addressOffset>0x00000044</addressOffset>
        </register>
        <!--PULLDOWN-->
        <register>
          <name>PULLDOWN</name>
          <description>Pins PullDOWN State</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Pins PullUp State</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>No pull selected</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>DOWN</name><description>Pin pulled up to GND</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
