lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE81.svd
        <!--SPULLDOWN-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>PULLDOWN_Set</name>
          <description>Set PULLDOWN bits</description>
          <addressOffset>0x00000048</addressOffset>
        </register>
        <!--CPULLDOWN-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>PULLDOWN_Clear</name>
          <description>Clear PULLDOWN bits</description>
          <addressOffset>0x0000004C</addressOffset>
        </register>
        <!--PD-->
        <register>
          <name>PD</name>
          <description>Pins Driver Mode</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Pins Driver Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue><name>Driver</name><description>Pull-Push driver</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>OpenDrain</name><description>Drain Pulled Up Line</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SPD-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>PD_Set</name>
          <description>Set PD bits</description>
          <addressOffset>0x00000050</addressOffset>
        </register>
        <!--CPD-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>PD_Clear</name>
          <description>Clear PD bits</description>
          <addressOffset>0x00000054</addressOffset>
        </register>
        <!--PWR0-->
        <register>
          <name>PWR0</name>
          <description>Power of Pins 0 - 15</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
            <dim>16</dim>
            <dimIncrement>2</dimIncrement>
            <dimIndex>0-15</dimIndex>
            <name>Pin_%s</name>
            <description>Read SPWR Register</description>
            <bitRange>[1:0]</bitRange>
            <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Level switch disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Slow</name><description>Front ~300ns</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Fast</name><description>Front ~100ns</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>MaxFast</name><description>Front ~10ns</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--PWR1-->
        <register>
          <name>PWR1</name>
          <description>Power of Pins 0 - 15</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>16-31</dimIndex>
              <name>Pin_%s</name>
              <description>Read SPWR1 Register</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Level switch disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Slow</name><description>Front ~300ns</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Fast</name><description>Front ~100ns</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>MaxFast</name><description>Front ~10ns</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SPWR0-->
        <register derivedFrom="MDR_PORTA.PWR0">
          <name>PWR0_Set</name>
          <description>Set PWR0 bits</description>
          <addressOffset>0x00000058</addressOffset>
          <access>write-only</access>
        </register>
        <!--SPWR1-->
        <register derivedFrom="MDR_PORTA.PWR1">
          <name>PWR1_Set</name>
          <description>Set PWR1 bits</description>
          <addressOffset>0x0000005C</addressOffset>
          <access>write-only</access>
        </register>
        <!--CPWR0-->
        <register>
          <name>PWR0_Clear</name>
          <description>Clear PWR0 bits</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>0-15</dimIndex>
              <name>Pin_%s</name>
              <description>Clear PWR0 bits</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ClrSlow</name><description>Front ~300ns</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ClrFast</name><description>Front ~100ns</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>ClrToOff</name><description>Pin Power Off</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--CPWR1-->
        <register>
          <name>PWR1_Clear</name>
          <description>Clear PWR1 bits</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>16</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>16-31</dimIndex>
              <name>Pin_%s</name>
              <description>Clear PWR1 bits</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>No action</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ClrSlow</name><description>Front ~300ns</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>ClrFast</name><description>Front ~100ns</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>ClrToOff</name><description>Pin Power Off</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--CL-->
        <register>
          <name>CL</name>
          <description>Pins Current Control enabled</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <dim>32</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0-31</dimIndex>
              <name>Pin_%s</name>
              <description>Read register SCL</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enable</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--SCL-->
        <register derivedFrom="MDR_PORTA.RXTX_Set">
          <name>CL_Set</name>
          <description>Set CL bits</description>
          <addressOffset>0x00000068</addressOffset>
        </register>
        <!--CCL-->
        <register derivedFrom="MDR_PORTA.RXTX_Clear">
          <name>CL_Clear</name>
          <description>Clear CL bits</description>
          <addressOffset>0x0000006C</addressOffset>
        </register>
