lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE81.svd
        <!-- CR1 -->
        <register>
          <name>CR1</name>
          <description>Control Register 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>LBM</name>
              <description>Loop Back Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LoopBack</name>
                  <description>TX send to RX test mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSE</name>
              <description>Synchronous Serial Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MS</name>
              <description>Master or Slave mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Master</name>
                  <description>Master Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Slave</name>
                  <description>Slave Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOD</name>
              <description>Slave mode Output Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SlaveTxEna</name>
                  <description>Slave mode transmit enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SlaveTxDis</name>
                  <description>Slave mode transmit disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ES_Ex_CR1 -->
          </fields>
        </register>
        <!-- Data -->
        <!-- #DATA_REG -->
        <register>
          <name>DR</name>
          <description>FIFO_Rx and FIFO_Tx access</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>Data</name>
              <description>Data value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- SR -->
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>TFE</name>
              <description>FIFO_TX is Empty</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>TX_NotEmpty</name><description>FIFO_TX is Not Empty</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>TX_Empty</name><description>FIFO_TX is Empty</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNF</name>
              <description>FIFO_TX is Not Full</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>TX_Full</name><description>FIFO_TX is Full</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>TX_NotFull</name><description>FIFO_TX is Not Full</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field>
              <name>RNE</name>
              <description>FIFO_RX is Not Empty</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>RX_NotEmpty</name><description>FIFO_RX is Empty</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>RX_Empty</name><description>FIFO_RX is Not Empty</description><value>1</value></enumeratedValue>
              </enumeratedValues>  
            </field>
            <field>
              <name>RFF</name>
              <description>FIFO_RX is Full</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>RX_NotFull</name><description>FIFO_RX is Not Full</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>RX_Full</name><description>FIFO_RX is Full</description><value>1</value></enumeratedValue>
              </enumeratedValues> 
            </field>
            <field>
              <name>BSY</name>
              <description>Transfer in progress</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Idle</name><description>FIFO_RX is Not Full</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Busy</name><description>Transfering</description><value>1</value></enumeratedValue>
              </enumeratedValues>           
            </field>
          </fields>
        </register>
