lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE81.svd
        <!--RIS-->
        <register>
          <name>RIS</name>
          <description>Raw IQR Status Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>RIM_RIS</name>
              <description>RI Modem Event</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Event Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Event Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>STCM_RIS</name>
              <description>STC Modem Event</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>DCDM_RIS</name>
              <description>DCD Modem Event</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>DSRM_RIS</name>
              <description>DSR Modem Event</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>RX_RIS</name>
              <description>RX Event</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>TX_RIS</name>
              <description>TX Event</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>RT_RIS</name>
              <description>RX Timeout Event</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>FE_RIS</name>
              <description>Frame Error Event</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>PE_RIS</name>
              <description>Parity Error Event</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>BE_RIS</name>
              <description>BreakLine Event</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="RIM_RIS">
              <name>OE_RIS</name>
              <description>Overrun FIFO_RX Event</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <!--MIS-->
        <register>
          <name>MIS</name>
          <description>Masked IQR Status Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>RIM_MIS</name>
              <description>RI Modem Event</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Event Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Event Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>STCM_MIS</name>
              <description>STC Modem Event</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>DCDM_MIS</name>
              <description>DCD Modem Event</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>DSRM_MIS</name>
              <description>DSR Modem Event</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>RX_MIS</name>
              <description>RX Event</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>TX_MIS</name>
              <description>TX Event</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>RT_MIS</name>
              <description>RX Timeout Event</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>FE_MIS</name>
              <description>Frame Error Event</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>PE_MIS</name>
              <description>Parity Error Event</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>BE_MIS</name>
              <description>BreakLine Event</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="RIM_MIS">
              <name>OE_MIS</name>
              <description>Overrun FIFO_RX Event</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <!--ICR-->
        <register>
          <name>ICR</name>
          <description>IRQ Clear Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>RIM_IC</name>
              <description>RI Modem Event</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Inactive state</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Clear</name><description>Clear event</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RIM_IC">
              <name>STCM_IC</name>
              <description>STC Modem Event</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>DCDM_IC</name>
              <description>DCD Modem Event</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>DSRM_IC</name>
              <description>DSR Modem Event</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>RX_IC</name>
              <description>RX Event</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>TX_IC</name>
              <description>TX Event</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>RT_IC</name>
              <description>RX Timeout Event</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>FE_IC</name>
              <description>Frame Error Event</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>PE_IC</name>
              <description>Parity Error Event</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>BE_IC</name>
              <description>BreakLine Event</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="RIM_IC">
              <name>OE_IC</name>
              <description>Overrun FIFO_RX Event</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <!--DMACR-->
        <register>
          <name>DMACR</name>
          <description>DMA Control Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>RXDMAE</name>
              <description>RX DMA Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>DMA disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>DMA enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RXDMAE">
              <name>TXDMAE</name>
              <description>TX DMA Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAonErr</name>
              <description>Disable DMA req on Error</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>IgnoreError</name><description>Ignore Errors</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>StopOnError</name><description>SReq and Req disable on Error</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
          </fields>
        </register>
        <!--TCR-->
        <register>
          <name>TCR</name>
          <description>Test Control Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>ITEN</name>
              <description>Test Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>Normal operation</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Testing Mode</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="ITEN">
              <name>TestFIFO</name>
              <description>FIFO test mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="ITEN">
              <name>SIRTest</name>
              <description>IrDA test mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
